import requests

API = 'https://api.single-developers.software/write'

text="""බුද්ධ ශාසනය අංග නවයකින් සමන්විත වේ. එහි ඇතුළත් ගාථා නම් වූ ශාසනයට අයත් විමාන වත්ථු පේ‍්‍රත වත්ථු දැන් ඔබට කියවිය හැකිය. මෙම විමාන වස්තු පාළි හා පේ‍්‍රත වස්තු පාළි අයත් වන්නේ ආශ්චර්යවත් ශ්‍රී සද්ධර්මයේ ඛුද්දක නිකායට ය. මෙහි විමාන වස්තුවේ තිබෙන්නේ මිනිස් ලොවෙහිදී පින්කම් කොට දෙව්ලොව ඉපිද දිව්‍ය සම්පත් අනුභව කරන පිරිස ගැනයි. පේ‍්‍රත වස්තුවෙහි තිබෙන්නේ පේ‍්‍රත ලෝකයෙහි ඉපිද අනන්ත දුක්ඛිත ජීවිත ගෙවන්නා වූ අවාසනාවන්ත පිරිසක් ගැනයි. ඒ සියල්ල නිමැවී තිබෙන්නේ තම තමන්ගේ කර්මානුරූපවය.

විමාන වස්තු කියැවීමේදී ඒ ඒ කර්මානුරූපව දිව්‍ය විමාන පහළ වී ඇති ආකාරය ගැන පුදුම සහගත තොරතුරු ඔබට ඉගෙන ගත හැකිය. ඔවුහු මිනිස් ලොවෙහිදී යහපත් කර්මයන් කොට ඒ ප‍්‍රතිවිපාක විඳිමින් සුව සේ කල්ගෙවති.

පේ‍්‍රත වස්තුවෙන් කියැවෙන්නේ පේ‍්‍රත ලෝකයෙහි තොරතුරුය. මනුෂ්‍යයන් විසින් දූෂිත සිතින් යුතුව සිත කය වචනයෙන් පව් කරන ලදුව එකී පාපයන්ගෙන් නිර්මිත වූ දුක්ඛිත ජීවිත ගැන අනුවේදනීය තොරුතුරු රැුසක් ඔබට ඉගෙන ගත හැකිය. ඔවුන් ඉතා දුක් සහිත ලෙස සෙම් සොටු ලේ සැරව ආදිය අනුභව කරමින් ස්වකීය සාපිපාසා නිවාගන්නට වෙහෙසෙන අයුරු හද කම්පා කරවන සුළුය. එමෙන්ම අකුසල කර්මයන් කෙරෙහි බලවත් බියක් මෙන්ම පිළිකුලක් ඇති වීම නිතැතින්ම සිදු වේ.

ලෝකයෙහි කර්ම හා කර්ම විපාක පිළිබඳව සටහන් වී ඇති අනේකවිධ තොරතුරුවලට මෙම විමාන වස්තු පේ‍්‍රත වස්තු දෙකෙන් ඉස්මතු වෙන කථා ප‍්‍රවෘත්තින්ගෙන් ලැබෙන්නේ බලවත් එළියකි. අචින්තනීය වූ විෂයක් පිළිබඳව මේ අංශු තොරතුරු ස්වල්පය පවා, අපගේ ජීවිතවලට ඉතා මැනවින් යා යුතු මගත් නොයා යුතු මගත් පෙන්වා දෙයි.

මිහිඳු මහරහතන් වහන්සේ ලක්දිවට වැඩම කොට පොදු ජනතාව වෙනුවෙන් පළමුවෙන්ම දේශනා කොට වදාළේ විමාන වස්තුව හා පේ‍්‍රත වස්තුවයි. ඒ තුළින් කර්මයෙහි ඇති සැබෑ ස්වභාවය පෙන්වා දුන් උන්වහන්සේ අනතුරුව වදාළේ චතුරාර්ය සත්‍යය පිළිබඳව ඉතා වැදගත් දේශනා රාශියක් අන්තර්ගත වූ සංයුක්ත නිකායෙහි සච්ච සංයුක්තයයි. ප‍්‍රථම ධර්ම සංගායනාවේදී ඛුද්දක නිකායෙහිලා සංග‍්‍රහ ලද විමාන වස්තු පේ‍්‍රත වස්තු පිළිබඳ දැනීමක් තෙරුවන් සරණ ගිය කා තුළත් තිබිය යුතුමය."""

body = {
  "text":f"{text}"
}

req = requests.post(API, headers={'Content-Type': 'application/json'}, json=body)

print(req.history[1].url)
